rick1082/sdk-nrf/applications/nrf5340_audio/src/bluetooth/le_audio_cis_gateway.c
	/* ACL connection established */
	LOG_INF("Connected: %s", addr);

	ret = bt_hci_get_conn_handle(conn, &conn_handle);
	if (ret) {
		LOG_ERR("Unable to get conn handle");
	} else {
#if (CONFIG_NRF_21540_ACTIVE)
		conn_tx_pwr = CONFIG_NRF_21540_MAIN_DBM;
#else
		conn_tx_pwr = CONFIG_BLE_CONN_TX_POWER_DBM;
#endif /* (CONFIG_NRF_21540_ACTIVE) */
		ret = ble_hci_vsc_conn_tx_pwr_set(conn_handle, conn_tx_pwr);
		if (ret) {
			LOG_ERR("Failed to set TX power for conn");
		} else {
			LOG_DBG("TX power set to %d dBm for connection %p", conn_tx_pwr,
				(void *)conn);
		}
	}

	ret = bt_conn_set_security(conn, BT_SECURITY_L2);
	if (ret) {
		LOG_ERR("Failed to set security to L2: %d", ret);
	}
}

static void disconnected_headset_cleanup(uint8_t chan_idx)
{
	headsets[chan_idx].headset_conn = NULL;
	k_work_cancel_delayable(&headsets[chan_idx].stream_start_sink_work);
	headsets[chan_idx].sink_ep = NULL;
	memset(headsets[chan_idx].sink_codec_cap, 0, sizeof(headsets[chan_idx].sink_codec_cap));
	k_work_cancel_delayable(&headsets[chan_idx].stream_start_source_work);
	headsets[chan_idx].source_ep = NULL;
	memset(headsets[chan_idx].source_codec_cap, 0, sizeof(headsets[chan_idx].source_codec_cap));
}

static void disconnected_cb(struct bt_conn *conn, uint8_t reason)
{
	int ret;
	uint8_t channel_index;
	char addr[BT_ADDR_LE_STR_LEN];

	(void)bt_addr_le_to_str(bt_conn_get_dst(conn), addr, sizeof(addr));

	LOG_INF("Disconnected: %s (reason 0x%02x)", addr, reason);

	bt_conn_unref(conn);

	ret = channel_index_get(conn, &channel_index);
	if (ret) {
		LOG_WRN("Unknown connection");
	} else {
		disconnected_headset_cleanup(channel_index);
	}

	ble_acl_start_scan();
}

#if (CONFIG_BT_AUDIO_RX)
static int discover_source(struct bt_conn *conn)
{
	int ret = 0;
	static uint8_t discover_index;

	audio_source_discover_param[discover_index].func = discover_source_cb;
	audio_source_discover_param[discover_index].dir = BT_AUDIO_DIR_SOURCE;
	ret = bt_bap_unicast_client_discover(conn, &audio_source_discover_param[discover_index]);
	discover_index++;

	/* Avoid multiple discover procedure sharing the same params */
	if (discover_index >= CONFIG_BT_MAX_CONN) {
		discover_index = 0;
	}

	return ret;
}
#endif /* (CONFIG_BT_AUDIO_RX) */

static void security_changed_cb(struct bt_conn *conn, bt_security_t level, enum bt_security_err err)
{
	int ret;

	if (err) {
		LOG_ERR("Security failed: level %d err %d", level, err);
		ret = bt_conn_disconnect(conn, err);
		if (ret) {
			LOG_ERR("Failed to disconnect %d", ret);
		}
	} else {
		LOG_DBG("Security changed: level %d", level);
		ret = discover_source(conn);
		if (ret) {
			LOG_WRN("Failed to discover sink: %d", ret);
		}
	}
}

static struct bt_conn_cb conn_callbacks = {
	.connected = connected_cb,
	.disconnected = disconnected_cb,
	.security_changed = security_changed_cb,
};

#if (CONFIG_BT_MCS)
/**
 * @brief	Callback handler for play/pause.
 *
 * @note	This callback is called from MCS after receiving a
 *		command from the client or the local media player.
 *
 * @param[in]	play  Boolean to indicate if the stream should be resumed or paused.
 */
static void le_audio_play_pause_cb(bool play)
{
	int ret;

	LOG_DBG("Play/pause cb, state: %d", play);

	if (play) {
		if (ep_state_check(headsets[AUDIO_CH_L].sink_stream.ep,
				   BT_BAP_EP_STATE_QOS_CONFIGURED)) {
			ret = bt_bap_stream_enable(&headsets[AUDIO_CH_L].sink_stream,
						   lc3_preset_sink.codec.meta,
						   lc3_preset_sink.codec.meta_count);

			if (ret) {
				LOG_WRN("Failed to enable left stream");
			}
		}

		if (ep_state_check(headsets[AUDIO_CH_R].sink_stream.ep,
				   BT_BAP_EP_STATE_QOS_CONFIGURED)) {
			ret = bt_bap_stream_enable(&headsets[AUDIO_CH_R].sink_stream,
						   lc3_preset_sink.codec.meta,
						   lc3_preset_sink.codec.meta_count);

			if (ret) {
				LOG_WRN("Failed to enable right stream");
			}
		}
	} else {
		le_audio_event_publish(LE_AUDIO_EVT_NOT_STREAMING);

		if (ep_state_check(headsets[AUDIO_CH_L].sink_stream.ep,
				   BT_BAP_EP_STATE_STREAMING)) {
			ret = bt_bap_stream_disable(&headsets[AUDIO_CH_L].sink_stream);

			if (ret) {
				LOG_WRN("Failed to disable left stream");
			}
		}

		if (ep_state_check(headsets[AUDIO_CH_R].sink_stream.ep,
				   BT_BAP_EP_STATE_STREAMING)) {
			ret = bt_bap_stream_disable(&headsets[AUDIO_CH_R].sink_stream);

			if (ret) {
				LOG_WRN("Failed to disable right stream");
			}
		}
	}

	playing_state = play;
}
#endif /* CONFIG_BT_MCS */

static int iso_stream_send(uint8_t const *const data, size_t size, struct le_audio_headset headset)
{
	int ret;
	struct net_buf *buf;

	/* net_buf_alloc allocates buffers for APP->NET transfer over HCI RPMsg,
	 * but when these buffers are released it is not guaranteed that the
	 * data has actually been sent. The data might be queued on the NET core,
	 * and this can cause delays in the audio.
	 * When stream_sent_cb() is called the data has been sent.
	 * Data will be discarded if allocation becomes too high, to avoid audio delays.
	 * If the NET and APP core operates in clock sync, discarding should not occur.
	 */
	if (atomic_get(&headset.iso_tx_pool_alloc) >= HCI_ISO_BUF_ALLOC_PER_CHAN) {
		if (!headset.hci_wrn_printed) {
			LOG_WRN("HCI ISO TX overrun on %s ch - Single print", headset.ch_name);
			headset.hci_wrn_printed = true;
		}

		return -ENOMEM;
	}

	headset.hci_wrn_printed = false;

	buf = net_buf_alloc(headset.iso_tx_pool, K_NO_WAIT);
	if (buf == NULL) {
		/* This should never occur because of the iso_tx_pool_alloc check above */
		LOG_WRN("Out of TX buffers");
		return -ENOMEM;
	}

	net_buf_reserve(buf, BT_ISO_CHAN_SEND_RESERVE);
	net_buf_add_mem(buf, data, size);

	atomic_inc(&headset.iso_tx_pool_alloc);

	ret = bt_bap_stream_send(&headset.sink_stream, buf,
				 get_and_incr_seq_num(&headset.sink_stream), BT_ISO_TIMESTAMP_NONE);
	if (ret < 0) {
		LOG_WRN("Failed to send audio data to %s: %d", headset.ch_name, ret);
		net_buf_unref(buf);
		atomic_dec(&headset.iso_tx_pool_alloc);
	}

	return 0;
}

static int initialize(le_audio_receive_cb recv_cb, le_audio_timestamp_cb timestmp_cb)
{
	int ret;
	static bool initialized;
	int headset_iterator = 0;
	int stream_iterator = 0;
	struct bt_bap_unicast_group_stream_pair_param pair_params[ARRAY_SIZE(headsets)];
	/* 2 streams (one sink and one source stream) for each headset */
	struct bt_bap_unicast_group_stream_param stream_params[(ARRAY_SIZE(headsets) * 2)];
	struct bt_bap_unicast_group_param param;

	if (initialized) {
		LOG_WRN("Already initialized");
		return -EALREADY;
	}

	if (recv_cb == NULL) {
		LOG_ERR("Receieve callback is NULL");
		return -EINVAL;
	}

	if (timestmp_cb == NULL) {
		LOG_ERR("Timestamp callback is NULL");
		return -EINVAL;
	}

	receive_cb = recv_cb;
	timestamp_cb = timestmp_cb;

